#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "94c60b5527f8daeca5df0197abf2cd75" -> "2a3e79ca97a0d0b10111b9cdb8308607"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "79232d6554dd2eb5f679253ee7af430f" -> "d3b5db4bf47bcbeea2bfb8b678dfb9a9"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "92c67221f6394b6e9bbfb95508d3c6ce" -> "6961bbc2895dec31826f809fafeeaf58"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "a68c2e53325f5c05862c4d84c47ae9c0" -> "faa332371ff7a246116443aef7603cae"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "e8dc435a768174e901f4a37bd61cdb6d" -> "d4b88f8d15a3a951899d18ecb4d67b62"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "58205e3b9fa0e62b1b0775101a3ba0dd" -> "fe261f60e9819f031747f4014b10e200"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "9ac3498f6b2f3552df4e64b10d5475a9" -> "09259f849fd7af2aa593f8355f3fbe9f"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "85e2799416bd4715be28288fe2dec60b" -> "f974acb9fa350e0ba0e3ed0695c911ad"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "f1f8577270136526874ceea613849d1e" -> "f67b72d65f86dbb10dfcbd71895035c3"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "f5f0153011f71e2eb80a234246dbe9e6" -> "b28de5772a733253a9472b728f4be803"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "82bf48486c047e70101bc24943a9f108" -> "caa3157ce93128327f8767c5d68d2959"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "b2368f743c68c7cddb6283fb0d0facf9" -> "a7bed74903332f3328ef43118896ffb0"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "13c25d7a06c5a9795bec7a0cbd2a3f1c" -> "aedbcc90107fbd8bf80eda8ff494ae1c"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "42b3eb42cf1380d7c58c0f5a88c1cb31" -> "1742002cc56d3ba450e51426a9120be3"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "f4defa5d6b0c8c853c3a6c5ac7bb1773" -> "61698341d26928f9b1fce219093526b5"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "78c2768b42fe54c72799542ff0608a46" -> "e227d2cc5d93b61876c273c21ec89cb4"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "6b970aae15cc1510ce2eda596197203d" -> "df0d2102e0b47590a3a812c24d6e14e3"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "d1d4d996c5a4bb9e858e6eda9db603d0" -> "f9ec969a92835df6cdc8e225eea4f1d5"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "3b596fdff9a475ebae6c6ed41052b4f1" -> "e73fb18998a5254e298f36e8c9973a52"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "afea37fed800073c2359301664153a40" -> "28a6375bef62d9be88cdf84dfd4f07a5"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c62398c5f9140362264038e01a55ed93" -> "af71da372103699f1daa4d3f783b3f90"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "2a7d5dfd2536f33d88819e34f7403919" -> "bc5955cfd782ad29e85e64e6c9115135"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "260d70bcc933ef2ceaba6575b6e5d6f4" -> "89e447c95aa00ad55a4ec4851908e01b"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "e7dc79dd53d2befd070f71ec338248bf" -> "b08421902a5d4eb221effd2687072492"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "c3bbb19f713b88cafb6fc3f4a836f0cc" -> "a00964e05082b149386ad02e07dbeb40"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "96cd754a691ebae1dfbdec9b0b5eadcc" -> "1222f70ad05a6da2aea2882a16407def"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "c473d254adc846b7ad8a0171b15e6c2f" -> "27258bbecde36af947c699d092f89cba"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "bb086d0e1bb147590046cdf357e0ed03" -> "8bcc7a166f3f43a21b6abd6ae92a7cd4"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "5a7f99b7d446f91792dc30925e63850b" -> "ffe14e71088d4e6563c0f1ccdfe9527a"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "66c794c7f8fa1284f46a99673b4d9473" -> "9d02fe2e314174d846f523afbf3b4052"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "c9b28da59f7f538ccc6a142177cb13a9" -> "fc16145713ad48379fcf99f028353290"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "272c0a839d74a35cd8748a7cf7053a13" -> "03d9922df27ebd267858eb5f756cb0d2"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "2124c527be51ac61980fbcaed3676da7" -> "81cb28d7137d59f967dd71a3dc040038"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "fd6dc8c9c31e33269d179805a95350db" -> "09697ef65ed9636a14ebba28152c1095"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "0c3cc57fe56983a4b65dbfc39bed1acd" -> "8fcba801742117ce3360cf5a327c7964"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "871dec6a0beb697ff82d22699e5a2a83" -> "3e65487b097f2ed3511d0d7e899c924b"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "912f45c41ff0aa6fcdfda0e750443ec5" -> "8c8056978dd3e20344ce47b23f3ec60d"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "7ff176fb44a4b68c7675d17bc4748f1f" -> "fe17465b8ca377ee50cf626c1222cfdf"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "0c436357a3da9b5f3935c81e08bb12bd" -> "52b2abef004ef39ff5c499273d93e8c7"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "24c3f8bd882347c540242ae31498b982" -> "c658792fb23def72499703d631321460"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "415620d8a5395927d897a132edc1b8f2" -> "b47b62a29f4528ffd8a8fb63b9f23089"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "a98ee06a8e2dce011732b15b9ebbbcfa" -> "09aac29f82a7ac89fd8c8dcd1f6e55a4"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "081a7b86a6fcf68fa6fe573fecfd3d3e" -> "9dfe761aa1ea3a450d2a0aa62f2a6175"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "bd89292f9c54ce37ad5231d2b252f1cd" -> "d9f0f4cad67b6b459b5c170f6a4025b4"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "edd0126229a51aba4774b5d764d72683" -> "1e296beab9be8c5d2e56e73a4fa53626"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "1ccb452cd430d1aa6ca42a46f8e6c9f0" -> "1c0900c63771b206727f35d31ca9f478"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "WgK47nsHj0Dw1D02uaYqKWzHsTaOIxp6VOclnEnZI6M=" -> "ipF2aBNmVDIA3D0FBsOQOvra/TlW+pVQgPg54gmm7SQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "xWA87zy2Y9BZp5EDnrGvbihQCj3d/uPqHf4oWBkSgXw=" -> "p+jKZ9TB0dvmioQo5C0AWVy4FzG7vs22QqIUqzVCy3s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "C2cJrTk3m3mcDa3oKuKmdAV6zyigAEPhsHkF/vYymqo=" -> "WnxmssNHqccQXCawvU7sBYesQUIO5KzA2zAixfyhlXI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "4j/yTl3zSl8Xj98N2SF71sU0cgf4Hdoeh0hRBuz6WmE=" -> "b0NZL7OgMnX1qoPL+gm7Lr5cFzsoMZx8pXf+n7qy6qI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "wgkKDRBroe0Esu1dvaPG4wMMNMmpOe6gNWud05EqbEE=" -> "aNMLXCm3R0VCngDna5IDQc1JVedWKzYehzswrfbTne0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "keKE5xluyiBWRyEUPkLqz7kiJC4ht/+8f01UvPCOyIM=" -> "bvpMrV+RHH3EznEw0WCU/AFBVYNQL/C5gS7Vn2aUrF4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "8HeBBeQ5oRD1uyH/wT/lUPXxnDyuYbSTLi4izJi9aQY=" -> "lpwE+Y8IXegnRytxNeF5XKpbwwBqMFmU8L45n0Wmn0M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Za8OJskPdWh9YF05PgcvMtld8AIzKncyp3B4dFtWkxE=" -> "Jfh4Pg1qVpPeLFsFyvjb1U0P/+kHQh1sgLR53eXJpNE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-25T21:19:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "M4gXGmCLMXqupk6wZN/KQJc53DMoy4vrce9eaxtfi8I=" -> "ViQjhC1tWNUDb/2yxPv8eMEp45CVTRPRqJiDCCanrsQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "vRm9sB70MS9C7x9Y26Y0Cccgs1pI7VVAqbr1H+cbZf0=" -> "FfEo/yDXCBLO3kcwCzXfYcaTRFMGD6cLkOuISQNf8oI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "Jm16VOPilOpL3sTRi/dEu4TPATJdINzpU66PQSbRBdE=" -> "+RZV7H7iInFOxkVHoytXUrYsXuO/E7EYp2nYycL8k0g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "hAAX9DjfnzNpvPEAD45ft2dhcIkOBbzeRRYsX10tnvk=" -> "sdFhG8ERCwuJ6Yqbq0sEQBBitBQeBZwTQmXz2tkauCU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "a92uRQKINNEQhxFzjxpCMYpKc2mhrZT6kTVgqEJmoio=" -> "B9tzjfNSRSO+/t3Zj/ngIgYZ4TKTl7lR6cjmi7tMVgE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "tgyGFB34lS/S29dvwIrmU2KdmmaP/aVf5+UmlEwNtck=" -> "7/HTXoVLdCODnra6nYSzbH88knLhSWOarssDi/NiUWQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "EbZ3AzNyS5cF9ExTnAjxXS+7NLvX82CiThJxKAb0Y6s=" -> "DBJBMhItuXzOHCI4xNTM/KeKD0Fg1BdMoOsvONRpTE4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "hQZHs2P14q3/BbCAKb5N23MkncCeBxF26NK9ApxTjKU=" -> "/EG5PNcwGSU2/CeBLpY41whtENV6wKTQw5qTAOM/Duo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "boJGkWwqxknroaImXVKRe/Jf/gJm9T1OgFL90QpXyKs=" -> "Y3n0EBcTJH3JOgqBNxW/BL2HllpJhE4BDLi978VuH/I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "G1Wiu8uJSYb4AxVrwOoygbAABjeeLcDGtO70brDeYqw=" -> "uOsqxlZPb/TynIFH+Z5HHQDR10v5RcBnYYN1mIuzodM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "VGJoFbtoR5JVLJBYkgWjo4g8NqNHgy7NdYlZU6afhCA=" -> "ifRd3evZd6J0MAgi91+ke0ifNdLSGinbm2DdRrGX2j0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-25T21:53:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "4nZWVURziyZ+nT8y8Iqz4Z4tJ0Yjariv9zsBj2kq190=" -> "tbGXIhFGjRqOvu/FyY/pbOUAfB7iCQHAdyRBlcqNPIA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "F6q9DHXI/6S0ESwWw4x0gGotR++ja0RvKocNrUSv2H4=" -> "ep77gR3wiZBh7iSOZiZrH2h74c8KTQ2DLTkgL5QwGcw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "T6trod4Mu7YdcRBFN46IqBFRkzK3Cdze3tRioUHFqNA=" -> "Jc0OZf4YUHfNa+t3DxAqxpO03seYC1UKa1y1s7knzUA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "FWJsAbHzxg6Z+f7eQ9cOuv5Vjt0mUzkVbNxWmmSAwjE=" -> "EwUlKUo7iXl69EHiBW5lKjJuKLjETcPwRi0A/BY+kr8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "htNT4jcrZi8jKazvdrEH/ddOqkZHtJLropbF2Q9K0xg=" -> "L4Iu1DoVLS4VIacn4jXQ08vulVFjy5qDMu5lG3h1G0A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "QNGcl0PZxiC3WlaLHlY4yO5GtHj01KSy6fivAxf6thY=" -> "BWdg1x5DycCOX6Nq2VOodIOkMb4XyCw6/fPs1gQDjFo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "VZcxQPfychXucVFy8/PC/smM1X1/A0ZnTh/059Mi734=" -> "/AoYgi4t/Ic6YxlzRsdgja2Alzu62KM2Z9IV8+/L16Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "yC/h6ccSB7IhmPwNbTZAD/u3h0yG1Wumm1jLgA/JN4c=" -> "Lv7CEqttYRPDcXNa7vAT4Eh9MtvBjyE3KAKeQb42QkY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "hehpgnaeSqt6lLge9IKvDhByzq5fdMAZijolVbFn2u0=" -> "cbdSl/ATFqfQKh5znPRoQg3NqLP6cJPQw7FjER+T8k8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "OexHWWmRk1Lkfg9O9mej8nJU5mik6+zZvvMgquV/WKo=" -> "s42iVAdNQ9RBPDbekcrSGiGV1au4xEROjUbsStc/ufU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "W69/p3U/ebLRfE35XVKwfFKZS88TGJG+alM+8udfBcA=" -> "QnVbFVbiM8E1D7ao/D+hUSY7zN9mvoV9B3vfUl/FVVA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "n82UeTa6m+4Q7WzO2dkG/Z4kNqZsLZVWmHBj9QoV5hA=" -> "usagXcIupjSXPP9cMXUeBSnWhMxQtXBSvkACy00bVZM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "aqhc18kZxyEQqjECAwMCvWp+RkR0g7X7lO2KsS5NNpg=" -> "Oc41yP39S3IF31kEBqp7Mmr/DxkyMr962XlilMsrXdI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "x0koqkk8bU2KSXmEHeSo3/2Z09SdFrO4XCx7yXd97ak=" -> "MHweY8XxBgaKt3MnP07agduECH4z8/Vw6VJuGyiVe/0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "J9Vq/G3lRbh+Pz6BKahLT/NZS6W0bGxo6dneo776YGU=" -> "dWgyamVhM0RcqdUuX+rLLiibV51/Pp8uSZLO+ndNljc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "LNYt3xRXpj0K7PmYxeDGtx7j1KwVYU6Nk7DagcV318w=" -> "dPFT78n8qwz8CLSfaZV96wwj/DGilGzXKapGaZJ2HBk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "9fiKCl9+XWEhkQa+lbA9H9iJwhM6xX8liToyEUhdJAc=" -> "BNJK0Y9rR1Jp/8NlB4I9W9LhW7yWoGjkqz3407Skjy4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "QErCqljDkVSWvcAm7mcO/NzfF0ev0iZXVWhreAWLVCI=" -> "smFA+az34mXKCVH5KVlwCTo/WYAHTztT4Q2LZ+07h58="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "run9azCvXCVsPqafeFT7jGPxTNOVYnS8dqUhk4zLO+8=" -> "GmCxcbFslZhgl8MXCykObB3uMIw2g8kQfOTdaBU87GY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "ptETTGKf/NosJ4NY/fd1nvfuOGjqAnqogwfGeYOeMoc=" -> "4pd+tjAROZeh0sHwdn92yJ8gOUAA0eXF6eOmTtuy5eY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "Rbi+XBtNCorEcD3vMnFuUo6uE2yMgKCSG9/D/jJrKC8=" -> "l11raVo0sSWj3NHRY81CLdwGW2xiLUbEa76AEEh2StI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "srEi9SsdMVd7567pOhnOEicJ89uigfJ+aHjEatG0J8c=" -> "RFJmaAmCqBs96fkxr/CjY7dWRekLuXZ8Nlp2WN/8CbE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "rYXBSNCTVlb2ia7TAiDLZRsd91Xunc4zVALvSXukojo=" -> "GFBNeuk1qJZT9hO5dybjLDQCEvBxBYePMzlyrMuOZK8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "CKQKgg2x1ksSdqapfFS+QlXthRDK8DtewJbUn09g94U=" -> "/l/k1JDP1Bk7JWVoQ9HG2I702CPoaI5sCCapNhL03Tk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "/r1/ZmnYNMtdXR5S8RmhLE3GJcvHkfai2kLPqtAb/gk=" -> "OmL05gLeiCgM67bakxM0xyWXxmL9nB7Oa430h+vRBjc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "S9uEpQsKnvEH8Ezbg0JyVZOxgCJYIEvRJS+VAjCtjWg=" -> "P5/unsKuDD61AOsuWbDnTPf+Vez1WXM5jIdvNl0VCp4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-25T21:19:59Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "0w1zu0" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-25T21:19:58Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-25T21:19:58Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 93 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*